/*
Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.

452 -> 11

82 -> 10

9012 -> 12
*/

System.Console.WriteLine("Please input integer number: ");
int summ = ConvertToInt32(Console.ReadLine());
int i[0];
int length = summ;
while (lengt < 9);
{
summ = i + 1
}
System.Console.WriteLine(summ);